In [1]:
# a ditctionary
people = {
    "first": ["Corey","Jane","Joe"],
    "last": ["Schafer","Doe","Doe"],
    "email": ["Corey@email.com","Jane@email.com","Joe@email.com"]
}

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame(people)

In [4]:
df

   first     last            email
0  Corey  Schafer  Corey@email.com
1   Jane      Doe   Jane@email.com
2    Joe      Doe    Joe@email.com

In [5]:
#combine two columns into one
df['first']+ ' ' +df['last']

0    Corey Schafer
1         Jane Doe
2          Joe Doe
dtype: object

In [9]:
#add this column into df
df['full_name'] = df['first']+ ' ' +df['last']

In [7]:
df

   first     last            email     first_last
0  Corey  Schafer  Corey@email.com  Corey Schafer
1   Jane      Doe   Jane@email.com       Jane Doe
2    Joe      Doe    Joe@email.com        Joe Doe

In [14]:
#delete columns
df.drop(columns =['first', 'last'], inplace=True)

In [17]:
df

             email      full_name
0  Corey@email.com  Corey Schafer
1   Jane@email.com       Jane Doe
2    Joe@email.com        Joe Doe

In [19]:
# split a column into two with space
df['full_name'].str.split(' ', expand = True)

       0        1
0  Corey  Schafer
1   Jane      Doe
2    Joe      Doe

In [20]:
#save splitted column into dataframe as first and last
df[['first','last']] = df['full_name'].str.split(' ', expand = True)

In [21]:
df

             email      full_name  first     last
0  Corey@email.com  Corey Schafer  Corey  Schafer
1   Jane@email.com       Jane Doe   Jane      Doe
2    Joe@email.com        Joe Doe    Joe      Doe

In [24]:
#adding a single row of data
df.append({'first': 'Tony'}, ignore_index=True)

             email      full_name  first     last
0  Corey@email.com  Corey Schafer  Corey  Schafer
1   Jane@email.com       Jane Doe   Jane      Doe
2    Joe@email.com        Joe Doe    Joe      Doe
3              NaN            NaN   Tony      NaN

In [26]:
people = {
    "first": ["Tony","Steve"],
    "last": ["Stark","Rogers"],
    "email": ["IronMan@email.com","Cap@email.com"]
}
df2 = pd.DataFrame(people)

In [27]:
df2

   first    last              email
0   Tony   Stark  IronMan@email.com
1  Steve  Rogers      Cap@email.com

In [28]:
# add the new dataframe to the old
df.append(df2, ignore_index=True)

               email      full_name  first     last
0    Corey@email.com  Corey Schafer  Corey  Schafer
1     Jane@email.com       Jane Doe   Jane      Doe
2      Joe@email.com        Joe Doe    Joe      Doe
3  IronMan@email.com            NaN   Tony    Stark
4      Cap@email.com            NaN  Steve   Rogers

In [29]:
df = df.append(df2, ignore_index=True)

In [30]:
df

               email      full_name  first     last
0    Corey@email.com  Corey Schafer  Corey  Schafer
1     Jane@email.com       Jane Doe   Jane      Doe
2      Joe@email.com        Joe Doe    Joe      Doe
3  IronMan@email.com            NaN   Tony    Stark
4      Cap@email.com            NaN  Steve   Rogers

In [31]:
#remove row
df.drop(index=4)

               email      full_name  first     last
0    Corey@email.com  Corey Schafer  Corey  Schafer
1     Jane@email.com       Jane Doe   Jane      Doe
2      Joe@email.com        Joe Doe    Joe      Doe
3  IronMan@email.com            NaN   Tony    Stark

In [33]:
#delete all last names that are Doe
filt = df['last']=='Doe'
df.drop(index=df[filt].index)
#combined, harder to read
df.drop(index=df[df['last']=='Doe'].index)

               email      full_name  first     last
0    Corey@email.com  Corey Schafer  Corey  Schafer
3  IronMan@email.com            NaN   Tony    Stark
4      Cap@email.com            NaN  Steve   Rogers